app/Controllers/Client.php

SELECT `tblregistration`.*, `tblusers`.`ContactNo`
FROM `tblregistration`
JOIN `tblusers` ON `tblusers`.`UserID` = `tblregistration`.`UserID`
WHERE `tblregistration`.`Status` = 'Pending'
AND `tblusers`.`OfficeName` = 'CENRO Kalamansig'
---
    public function confirmation()
    {
        // Start a session to retrieve user data
        $session = session();
        $userData = $session->get('userData'); // Assuming user data is stored in the session

        // Get the OfficeName from the logged-in user
        $userOffice = $userData['OfficeName'];

        // Initialize the ClientModel
        $clientModel = new ClientModel();

        // Use a join query to merge data from tblusers and filter by OfficeName
        $clientData = $clientModel
            ->select('tblregistration.*, tblusers.ContactNo')  // Select all fields from tlbregistration and ContactNo from tblusers
            ->join('tblusers', 'tblusers.UserID = tblregistration.UserID') // Join tblusers on UserID
            ->where('tblregistration.Status', 'Pending')       // Filter by Status in tlbregistration
            ->where('tblusers.OfficeName', $userOffice)        // Filter by OfficeName of the logged-in user
            ->findAll();                                       // Fetch filtered client records